In [5]:
import pandas as pd

Считать данные с помощью pandas
Вывести на экран первые 5 строк

In [6]:
df = pd.read_csv('kc_house_data.csv', sep = ',', encoding= 'latin-1')
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,"7129300520,""20141013T000000"",221900,3,1,1180,5...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"6414100192,""20141209T000000"",538000,3,2.25,257...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"5631500400,""20150225T000000"",180000,2,1,770,10...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"2487200875,""20141209T000000"",604000,4,3,1960,5...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"1954400510,""20150218T000000"",510000,3,2,1680,8...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

1.2 Создать новый признак delta_renovated, который будет содержать разницу в годах между годом реновацией дома и годом постройки дома
Если реновации дома не было, то в новом признаке поставьте 0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 22 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               21613 non-null  object
 1   date             0 non-null      float64
 2   price            0 non-null      float64
 3   bedrooms         0 non-null      float64
 4   bathrooms        0 non-null      float64
 5   sqft_living      0 non-null      float64
 6   sqft_lot         0 non-null      float64
 7   floors           0 non-null      float64
 8   waterfront       0 non-null      float64
 9   view             0 non-null      float64
 10  condition        0 non-null      float64
 11  grade            0 non-null      float64
 12  sqft_above       0 non-null      float64
 13  sqft_basement    0 non-null      float64
 14  yr_built         0 non-null      float64
 15  yr_renovated     0 non-null      float64
 16  zipcode          0 non-null      float64
 17  lat              0 non-null      float64
 18  long             0 non-null      float64
 19  sqft_living15    0 non-null      float64
 20  sqft_lot15       0 non-null      float64
 21  delta_renovated  0 non-null      float64
dtypes: float64(21), object(1)
memory usage: 3.5+ MB

1.2 Создать новый признак delta_renovated, который будет содержать разницу в годах между годом реновацией дома и годом постройки дома

In [13]:
df['delta_renovated'] = pd.to_numeric(df['yr_built']-['yr_renovated'])
df

<class 'AttributeError'>: 'float' object has no attribute 'split'

1.3 Создайте признаки года продажи, месяца продажи

In [15]:
def convert2(x):
    memory = x.split('date')
    res = memory[1:]
    return ' '.join(res)
    df['date'] = df['date of sale'].apply(convert2)
    df

1.4 Удалите признаки date, zipcode, lat, long

In [16]:
df.drop(columns=['date', 'zipcode','lat', 'long'], inplace=True)
df.head()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,sqft_living15,sqft_lot15,delta_renovated
0,"7129300520,""20141013T000000"",221900,3,1,1180,5...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"6414100192,""20141209T000000"",538000,3,2.25,257...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"5631500400,""20150225T000000"",180000,2,1,770,10...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"2487200875,""20141209T000000"",604000,4,3,1960,5...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"1954400510,""20150218T000000"",510000,3,2,1680,8...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Создайте датафрейм с клиентами:
clients = pd.DataFrame({
'client_id': [1459, 4684, 3498, 3942, 4535, 2308, 2866, 2765, 1472, 4236, 2295,
939, 3840, 280, 20, 4332, 3475, 4213, 3113, 4809, 2134, 2242,
2068, 4929, 1384, 1589, 3317, 2260, 1727, 1764, 1611, 1474],
'house_id': [8965450190, 6823100225, 5104540330, 2131701075, 1522700060,
1189000207, 6821600300, 7137950720, 9510920050, 6131600255,
5428000070, 1788800910, 8100400160, 3123049142, 6306800010,
5083000375, 7920100025, 1951600150, 809001400, 339600110,
1622049154, 1099600250, 8563000110, 2768100205, 3995700435,
8861700030, 3303980210, 7731100066, 8146100580, 825069097,
3889100029, 9524100196]
})

In [22]:
clients = pd.DataFrame({
    'client_id': [1459, 4684, 3498, 3942, 4535, 2308, 2866, 2765, 1472, 4236, 2295,
939, 3840, 280, 20, 4332, 3475, 4213, 3113, 4809, 2134, 2242,
2068, 4929, 1384, 1589, 3317, 2260, 1727, 1764, 1611, 1474],
    'house_id': [8965450190, 6823100225, 5104540330, 2131701075, 1522700060,
1189000207, 6821600300, 7137950720, 9510920050, 6131600255,
5428000070, 1788800910, 8100400160, 3123049142, 6306800010,
5083000375, 7920100025, 1951600150, 809001400, 339600110,
1622049154, 1099600250, 8563000110, 2768100205, 3995700435,
8861700030, 3303980210, 7731100066, 8146100580, 825069097,
3889100029, 9524100196]
})

In [23]:
clients2 = clients.set_index('house_id')

In [24]:
clients2

            client_id
house_id
8965450190       1459
6823100225       4684
5104540330       3498
2131701075       3942
1522700060       4535
1189000207       2308
6821600300       2866
7137950720       2765
9510920050       1472
6131600255       4236
5428000070       2295
1788800910        939
8100400160       3840
3123049142        280
6306800010         20
5083000375       4332
7920100025       3475
1951600150       4213
809001400        3113
339600110        4809
1622049154       2134
1099600250       2242
8563000110       2068
2768100205       4929
3995700435       1384
8861700030       1589
3303980210       3317
7731100066       2260
8146100580       1727
825069097        1764
3889100029       1611
9524100196       1474

In [25]:
df

,,,,,,,,,,,,,,,,",0,0,3,7,3040,0,1999,0,98030""",47.3817,-122.206,2670,6259,delta_renovated
7663700610,20150310T000000,477500.0,4,1.75,1860,9364,1.0,0,0,3,7,1080,780,1953,0,98125,47.7310,-122.301,1800,9364,-122.301
7520000330,20140813T000000,285000.0,3,2.50,1690,7460,1.0,0,0,3,7,870,820,1997,0,98146,47.4964,-122.353,1900,7302,-122.353
1521049156,20141010T000000,255000.0,3,2.75,1900,16117,1.0,0,0,4,7,1900,0,1958,0,98001,47.3144,-122.278,1640,19166,-122.278
6648760150,20140728T000000,315000.0,3,2.50,1600,7982,2.0,0,0,3,8,1600,0,1993,0,98001,47.3397,-122.266,1890,9830,-122.266
1807900300,20141217T000000,830000.0,6,3.00,2530,9000,1.0,0,0,3,6,2530,0,1978,0,98033,47.6716,-122.199,1886,6000,-122.199
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
263000018,20140521T000000,360000.0,3,2.50,1530,1131,3.0,0,0,3,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509,-122.346
6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,3,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200,-122.362
1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,3,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007,-122.299
291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,3,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287,-122.069
1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,3,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357,-122.299

In [20]:
df2 = df.set_index('id')

In [21]:
df2

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,sqft_living15,sqft_lot15,delta_renovated
id,,,,,,,,,,,,,,,,,
"7129300520,""20141013T000000"",221900,3,1,1180,5650,""1"",0,0,3,7,1180,0,1955,0,""98178"",47.5112,-122.257,1340,5650",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"6414100192,""20141209T000000"",538000,3,2.25,2570,7242,""2"",0,0,3,7,2170,400,1951,1991,""98125"",47.721,-122.319,1690,7639",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"5631500400,""20150225T000000"",180000,2,1,770,10000,""1"",0,0,3,6,770,0,1933,0,""98028"",47.7379,-122.233,2720,8062",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"2487200875,""20141209T000000"",604000,4,3,1960,5000,""1"",0,0,5,7,1050,910,1965,0,""98136"",47.5208,-122.393,1360,5000",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"1954400510,""20150218T000000"",510000,3,2,1680,8080,""1"",0,0,3,8,1680,0,1987,0,""98074"",47.6168,-122.045,1800,7503",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
"0263000018,""20140521T000000"",360000,3,2.5,1530,1131,""3"",0,0,3,8,1530,0,2009,0,""98103"",47.6993,-122.346,1530,1509",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"6600060120,""20150223T000000"",400000,4,2.5,2310,5813,""2"",0,0,3,8,2310,0,2014,0,""98146"",47.5107,-122.362,1830,7200",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"1523300141,""20140623T000000"",402101,2,0.75,1020,1350,""2"",0,0,3,7,1020,0,2009,0,""98144"",47.5944,-122.299,1020,2007",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"0291310100,""20150116T000000"",400000,3,2.5,1600,2388,""2"",0,0,3,8,1600,0,2004,0,""98027"",47.5345,-122.069,1410,1287",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"1523300157,""20141015T000000"",325000,2,0.75,1020,1076,""2"",0,0,3,7,1020,0,2008,0,""98144"",47.5941,-122.299,1020,1357",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
joined = clients2.join(df2)
joined.head()

            client_id  47.3817  -122.206  2670  6259  delta_renovated
339600110        4809      NaN       NaN   NaN   NaN              NaN
809001400        3113      NaN       NaN   NaN   NaN              NaN
825069097        1764      NaN       NaN   NaN   NaN              NaN
1099600250       2242      NaN       NaN   NaN   NaN              NaN
1189000207       2308      NaN       NaN   NaN   NaN              NaN

In [22]:
merged = clients2.merge(df, left_on='client_id', right_on='id')
merged

<class 'NameError'>: name 'clients2' is not defined

3.1 Найдите среднюю стоимость домов в зависимости от количества спален

In [27]:

df.groupby('price').agg({'bedrooms': 'mean'})

Empty DataFrame
Columns: [bedrooms]
Index: []

In [ ]:
df.groupby('Company').agg({'Price_euros': [ 'min','mean','max']})

3.2 Найдите минимальную, среднюю и максимальную стоимости домов в зависимости от состояния дома

In [28]:
df.groupby('price').agg({'grade': [ 'min','mean','max']})

Empty DataFrame
Columns: [(grade, min), (grade, mean), (grade, max)]
Index: []

3.3 Постройте таблицу с подсчетом количества домов в данных в зависимости от вида на набережную и оценкой вида

In [29]:
df = pd.read_csv('kc_house_data.csv', sep = ',', encoding= 'latin-1')
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,"7129300520,""20141013T000000"",221900,3,1,1180,5...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"6414100192,""20141209T000000"",538000,3,2.25,257...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"5631500400,""20150225T000000"",180000,2,1,770,10...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"2487200875,""20141209T000000"",604000,4,3,1960,5...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"1954400510,""20150218T000000"",510000,3,2,1680,8...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  object
 1   date           0 non-null      float64
 2   price          0 non-null      float64
 3   bedrooms       0 non-null      float64
 4   bathrooms      0 non-null      float64
 5   sqft_living    0 non-null      float64
 6   sqft_lot       0 non-null      float64
 7   floors         0 non-null      float64
 8   waterfront     0 non-null      float64
 9   view           0 non-null      float64
 10  condition      0 non-null      float64
 11  grade          0 non-null      float64
 12  sqft_above     0 non-null      float64
 13  sqft_basement  0 non-null      float64
 14  yr_built       0 non-null      float64
 15  yr_renovated   0 non-null      float64
 16  zipcode        0 non-null      float64
 17  lat            0 non-null      float64
 18  long           0 non-null      float64
 19  sqft_living15  0 non-null      float64
 20  sqft_lot15     0 non-null      float64
dtypes: float64(20), object(1)
memory usage: 3.4+ MB

In [33]:
df.pivot_table(index= 'id', columns= 'waterfront',
              values= 'view', aggfunc= 'count', 
              fill_value=0
              )

Empty DataFrame
Columns: []
Index: []

3.4 Каких домов в зависимости от этажности и количества спален больше?

In [35]:
pd.crosstab(index=df['bedrooms'], columns=df['floors'])

Empty DataFrame
Columns: []
Index: []

In [36]:
df.groupby('bedrooms').agg({'floors': [ 'min','mean','max']})

Empty DataFrame
Columns: [(floors, min), (floors, mean), (floors, max)]
Index: []

3.2 Найдите минимальную, среднюю и максимальную стоимости домов в зависимости от состояния дома

In [36]:
df.groupby('delta_renovated').agg({',0,0,3,7,3040,0,1999,0,98030"': [ 'min','mean','max']})

                ,0,0,3,7,3040,0,1999,0,98030"
                                          min     mean    max
delta_renovated
-122.491                                98070  98070.0  98070
-122.486                                98070  98070.0  98070
-122.465                                98070  98070.0  98070
-122.464                                98070  98070.0  98070
-122.456                                98070  98070.0  98070
...                                       ...      ...    ...
-121.725                                98045  98045.0  98045
-121.723                                98045  98045.0  98045
-121.405                                98014  98014.0  98014
-121.403                                98014  98014.0  98014
-121.364                                98014  98014.0  98014

[547 rows x 3 columns]

3.3 Постройте таблицу с подсчетом количества домов в данных в зависимости от вида на набережную и оценкой вида

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 3596 entries, (7663700610, '20150310T000000', 477500.0, 4, 1.75, 1860, 9364, 1.0, 0, 0, 3, 7, 1080, 780, 1953, 0) to (1523300157, '20141015T000000', 325000.0, 2, 0.75, 1020, 1076, 2.0, 0, 0, 3, 7, 1020, 0, 2008, 0)
Data columns (total 7 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   ,0,0,3,7,3040,0,1999,0,98030"  3596 non-null   int64
 1   47.3817                        3596 non-null   float64
 2   -122.206                       3596 non-null   float64
 3   2670                           3596 non-null   int64
 4   6259                           3596 non-null   int64
 5   delta_renovated                3596 non-null   float64
 6   beadroom                       3596 non-null   int64
dtypes: float64(3), int64(4)
memory usage: 561.9+ KB

In [37]:
round(df.pivot_table(index='id', columns= 'waterfront',
              values= 'floors', aggfunc= 'mean', 
              fill_value=0
              ), 2)

Empty DataFrame
Columns: []
Index: []

3.4 Каких домов в зависимости от этажности и количества спален больше?

In [38]:
pd.crosstab(index=df['bedrooms'], columns=df['floors'])

Empty DataFrame
Columns: []
Index: []